# Data Reformat
reformat unstructure data into structure data

In [1]:
%load_ext autoreload
%autoreload 2
import sys
import os 

import pandas as pd
import numpy as np
from IPython.core.interactiveshell import InteractiveShell
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.font_manager as fm

sys.path.append('../')
import conf
from utils import (
                    correct_column_type_by_value_range,
                    LogManager,
)

In [5]:
# global settings
InteractiveShell.ast_node_interactivity = "all"
pd.set_option('display.max_rows', 50)
pd.set_option('display.max_columns',1000)
pd.set_option('display.width',100)
sns.set(rc={'figure.figsize':(11,4)})
LogManager.created_filename = os.path.join(conf.LOG_DIR, 'data_reformat.log')
logger = LogManager.get_logger(__name__)

In [3]:
# global variables
DEFAULT_MISSING_VALUE = 0
FONT = fm.FontProperties(fname = os.path.join(conf.LIB_DIR,'simsun.ttc'))
input_data_folder  = conf.ROUND_TWO_TRAIN_DATA_DIR

In [4]:
# functions
def combine_round_one_and_round_two_train_df(filename):
    train_round_one_df = pd.read_csv(os.path.join(conf.ROUND_ONE_TRAIN_DATA_DIR, filename))
    train_round_two_df = pd.read_csv(os.path.join(conf.ROUND_TWO_TRAIN_DATA_DIR, filename))
    train_df = pd.concat([train_round_one_df, train_round_two_df],axis=0)
    assert train_df.shape == (train_round_one_df.shape[0] + train_round_two_df.shape[0],train_round_two_df.shape[1])
    train_df.drop_duplicates(inplace=True)
    train_df.to_csv(os.path.join(conf.DATA_DIR,'%s'%filename),index=False)
    logger.info('%s has been saved'%os.path.join(conf.DATA_DIR,'%s'%filename))
    return train_df

In [5]:
! du -sh ../data/train_preliminary/*

4.0K	../data/train_preliminary/README
75M	../data/train_preliminary/ad.csv
553M	../data/train_preliminary/click_log.csv
9.4M	../data/train_preliminary/user.csv

In [6]:
! du -sh ../data/train_semi_final/*

4.0K	../data/train_semi_final/README
107M	../data/train_semi_final/ad.csv
1.4G	../data/train_semi_final/click_log.csv
24M	../data/train_semi_final/user.csv

In [7]:
! du -sh ../data/test/*

4.0K	../data/test/README
79M	../data/test/ad.csv
654M	../data/test/click_log.csv

In [8]:
# combine round one and round two ad csv
train_ad_df = combine_round_one_and_round_two_train_df('ad.csv')
train_user_df = combine_round_one_and_round_two_train_df('user.csv')
train_click_df = combine_round_one_and_round_two_train_df('click_log.csv')

../data/ad.csv has been saved
../data/user.csv has been saved
../data/click_log.csv has been saved

In [9]:
train_user_df.shape

(3000000, 3)

In [10]:
# train - ad.csv
train_ad_df = pd.read_csv(os.path.join(conf.DATA_DIR, 'ad.csv'))

In [11]:
train_ad_df.duplicated()

0          False
1          False
2          False
3          False
4          False
           ...
4031026    False
4031027    False
4031028    False
4031029    False
4031030    False
Length: 4031031, dtype: bool

In [12]:
train_ad_df.head(200)

     creative_id  ad_id product_id  product_category  advertiser_id industry
0              1      1         \N                 5            381       78
1              4      4         \N                 5            108      202
2              7      7         \N                 5            148      297
3              8      8         \N                 5            713      213
4              9      9         \N                 5            695      213
..           ...    ...        ...               ...            ...      ...
195          355    556       1374                 2             20      248
196          357    383         \N                 9           5797      155
197          358    559         \N                18           5932      114
198          360    562      29002                 3            238      322
199          361    562      29002                 3            238      322

[200 rows x 6 columns]

In [13]:
train_click_df.head()

   time  user_id  creative_id  click_times
0     9    30920       567330            1
1    65    30920      3072255            1
2    56    30920      2361327            1
3     6   309204       325532            1
4    59   309204      2746730            1

In [14]:
train_ad_df.dtypes

creative_id          int64
ad_id                int64
product_id          object
product_category     int64
advertiser_id        int64
industry            object
dtype: object

In [15]:
train_ad_df.describe()

        creative_id         ad_id  product_category  advertiser_id
count  4.031031e+06  4.031031e+06      4.031031e+06   4.031031e+06
mean   2.218314e+06  1.909664e+06      7.805786e+00   2.843166e+04
std    1.283356e+06  1.098174e+06      6.740812e+00   1.542167e+04
min    1.000000e+00  1.000000e+00      1.000000e+00   2.000000e+00
25%    1.106938e+06  9.639995e+05      2.000000e+00   1.604800e+04
50%    2.218094e+06  1.910837e+06      5.000000e+00   2.705100e+04
75%    3.329444e+06  2.860250e+06      1.800000e+01   3.926000e+04
max    4.445720e+06  3.812202e+06      1.800000e+01   6.296500e+04

In [16]:
train_ad_df.dtypes

creative_id          int64
ad_id                int64
product_id          object
product_category     int64
advertiser_id        int64
industry            object
dtype: object

In [17]:
len(train_ad_df['product_id'].unique())

42114

In [18]:
round(len(train_ad_df[train_ad_df.product_id=='\\N'])/len(train_ad_df),2)

0.36

In [19]:
len(train_ad_df)

4031031

In [20]:
mask = train_ad_df.product_id=='\\N'
train_ad_df[mask]

         creative_id    ad_id product_id  product_category  advertiser_id industry
0                  1        1         \N                 5            381       78
1                  4        4         \N                 5            108      202
2                  7        7         \N                 5            148      297
3                  8        8         \N                 5            713      213
4                  9        9         \N                 5            695      213
...              ...      ...        ...               ...            ...      ...
4030986      4445515  3812001         \N                18          25967       28
4030998      4445561  3812046         \N                18          26787       13
4031001      4445589  3812073         \N                18          59055       26
4031016      4445664  3812147         \N                18          19750       74
4031027      4445701  3812183         \N                 5          19188      296

[1441982 rows x 6 columns]

In [21]:
mask = train_ad_df.industry=='\\N'
train_ad_df[mask]

         creative_id    ad_id product_id  product_category  advertiser_id industry
516              907     1403      42462                 4           7159       \N
583              997     1551         \N                17          10577       \N
608             1034     1596      42462                 4           7159       \N
659             1108     1691      42522                 4          10230       \N
926             1511     2185      40491                 4           6918       \N
...              ...      ...        ...               ...            ...      ...
4031021      4445675  3812157      39063                17            427       \N
4031026      4445697  3812179      41285                17            427       \N
4031028      4445712  3812194      35885                17            427       \N
4031029      4445719  3812201      39287                17            427       \N
4031030      4445720  3812202      39287                17            427       \N

[164954 rows x 6 columns]

In [22]:
# map nan value into 0 and change data type into int
train_ad_df['product_id'] = train_ad_df['product_id'].apply(lambda x: np.nan if x =='\\N' else int(x))
train_ad_df['industry'] = train_ad_df['industry'].apply(lambda x: np.nan if x=='\\N' else int(x))

In [23]:
train_ad_df.dtypes

creative_id           int64
ad_id                 int64
product_id          float64
product_category      int64
advertiser_id         int64
industry            float64
dtype: object

In [24]:
train_ad_df['industry'].isnull().sum()

164954

In [25]:
### test - ad.csv 
test_ad_df = pd.read_csv(os.path.join(conf.TEST_DATA_DIR, 'ad.csv'))

In [26]:
len(test_ad_df)

2618159

In [27]:
test_ad_df['product_id'] = test_ad_df['product_id'].apply(lambda x: np.nan if x =='\\N' else int(x))
test_ad_df['industry'] = test_ad_df['industry'].apply(lambda x: np.nan if x=='\\N' else int(x))

In [28]:
# train - click_log.csv
train_click_log_df = pd.read_csv(os.path.join(conf.DATA_DIR, 'click_log.csv'))

In [29]:
train_click_log_df.head()

   time  user_id  creative_id  click_times
0     9    30920       567330            1
1    65    30920      3072255            1
2    56    30920      2361327            1
3     6   309204       325532            1
4    59   309204      2746730            1

In [30]:
train_click_log_df.dtypes

time           int64
user_id        int64
creative_id    int64
click_times    int64
dtype: object

In [31]:
train_click_log_df.shape

(100292933, 4)

In [32]:
# test - click_log.csv
test_click_log_df = pd.read_csv(os.path.join(conf.TEST_DATA_DIR, 'click_log.csv'))

In [33]:
len(test_click_log_df)

33585512

In [34]:
# train - user.csv
train_user_df = pd.read_csv(os.path.join(conf.DATA_DIR, 'user.csv'))

In [35]:
train_user_df.head()

   user_id  age  gender
0        1    4       1
1        2   10       1
2        3    7       2
3        4    5       1
4        5    4       1

In [36]:
len(train_user_df)

3000000

In [37]:
train_user_df.dtypes

user_id    int64
age        int64
gender     int64
dtype: object

In [38]:
train_user_df.head()

   user_id  age  gender
0        1    4       1
1        2   10       1
2        3    7       2
3        4    5       1
4        5    4       1

In [39]:
train_user_df['y'] = list(zip(train_user_df['gender'], train_user_df['age']))

In [40]:
label_map_dict = {0: (1, 1),
                  1: (1, 2),
                  2: (1, 3),
                  3: (1, 4),
                  4: (1, 5),
                  5: (1, 6),
                  6: (1, 7),
                  7: (1, 8),
                  8: (1, 9),
                  9: (1, 10),
                  10: (2, 1),
                  11: (2, 2),
                  12: (2, 3),
                  13: (2, 4),
                  14: (2, 5),
                  15: (2, 6),
                  16: (2, 7),
                  17: (2, 8),
                  18: (2, 9),
                  19: (2, 10)}

In [41]:
label_map_dict.items()

dict_items([(0, (1, 1)), (1, (1, 2)), (2, (1, 3)), (3, (1, 4)), (4, (1, 5)), (5, (1, 6)), (6, (1, 7)), (7, (1, 8)), (8, (1, 9)), (9, (1, 10)), (10, (2, 1)), (11, (2, 2)), (12, (2, 3)), (13, (2, 4)), (14, (2, 5)), (15, (2, 6)), (16, (2, 7)), (17, (2, 8)), (18, (2, 9)), (19, (2, 10))])

In [42]:
reverse_label_map_dict = dict([(value,key)for key, value in label_map_dict.items()])

In [43]:
reverse_label_map_dict

{(1, 1): 0,
 (1, 2): 1,
 (1, 3): 2,
 (1, 4): 3,
 (1, 5): 4,
 (1, 6): 5,
 (1, 7): 6,
 (1, 8): 7,
 (1, 9): 8,
 (1, 10): 9,
 (2, 1): 10,
 (2, 2): 11,
 (2, 3): 12,
 (2, 4): 13,
 (2, 5): 14,
 (2, 6): 15,
 (2, 7): 16,
 (2, 8): 17,
 (2, 9): 18,
 (2, 10): 19}

In [44]:
train_user_df['y'] = train_user_df['y'].apply(lambda x : reverse_label_map_dict[x])

In [45]:
train_user_df.head()

   user_id  age  gender   y
0        1    4       1   3
1        2   10       1   9
2        3    7       2  16
3        4    5       1   4
4        5    4       1   3

In [46]:
train_user_df.to_feather(os.path.join(conf.DATA_DIR, 'label_round_one_df.feather'))

In [47]:
# merge train dfs
raw_train_df = train_click_log_df.merge(train_ad_df,how='left',on='creative_id')

In [48]:
raw_train_df = raw_train_df.merge(train_user_df,how='left',on='user_id')

In [49]:
raw_train_df.head()

,time,user_id,creative_id,click_times,ad_id,product_id,product_category,advertiser_id,industry,age,gender,y
0,9,30920,567330,1,504423,30673.0,3,32638,319.0,2,1,1
1,65,30920,3072255,1,2642300,1261.0,2,6783,6.0,2,1,1
2,56,30920,2361327,1,2035918,1261.0,2,6783,6.0,2,1,1
3,6,309204,325532,1,292523,27081.0,3,32066,242.0,6,1,5
4,59,309204,2746730,1,2362208,NaN,18,14682,88.0,6,1,5

In [50]:
raw_train_df['industry'].isnull().sum()

4239870

In [51]:
mask = raw_train_df['industry'].isnull()
raw_train_df[mask]

,time,user_id,creative_id,click_times,ad_id,product_id,product_category,advertiser_id,industry,age,gender,y
243,80,309221,1503096,1,1307003,35106.0,4,2879,NaN,4,1,3
430,89,309225,3604133,1,3103050,39835.0,4,28442,NaN,6,2,15
498,7,309230,144135,1,129480,41134.0,4,29105,NaN,10,2,19
505,31,309230,235389,1,211656,643.0,3,725,NaN,10,2,19
588,11,309231,105391,1,95737,1231.0,2,756,NaN,2,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
100292761,62,2137713,2593836,1,2233275,43087.0,4,11055,NaN,2,2,11
100292888,12,2137720,44727,1,41954,NaN,7,16128,NaN,4,1,3
100292918,41,2137721,1371132,1,1198117,36256.0,17,38079,NaN,7,1,6
100292928,38,2137722,1077257,1,945517,NaN,7,19135,NaN,3,1,2
100292930,77,2137722,3612763,1,3110345,39937.0,17,21701,NaN,3,1,2

In [52]:
correct_column_type_by_value_range(raw_train_df)

2020-06-26 18:21:05,688 - utils.utils - INFO - correct_column_type_by_value_range开始
2020-06-26 18:21:05,691 - utils.utils - INFO - check_columns开始
2020-06-26 18:21:05,692 - utils.utils - INFO - check_columns已完成，共用时0:00:00
2020-06-26 18:21:52,890 - utils.utils - INFO - col_types: time                    int8
user_id                int64
creative_id            int64
click_times            int16
ad_id                  int32
product_id           float64
product_category    category
advertiser_id          int32
industry            category
age                     int8
gender                  int8
y                       int8
dtype: object
2020-06-26 18:21:52,893 - utils.utils - INFO - correct_column_type_by_value_range已完成，共用时0:00:47

In [53]:
raw_train_df.dtypes

time                    int8
user_id                int64
creative_id            int64
click_times            int16
ad_id                  int32
product_id           float64
product_category    category
advertiser_id          int32
industry            category
age                     int8
gender                  int8
y                       int8
dtype: object

In [54]:
raw_train_df.reset_index(drop=True, inplace=True)

In [55]:
raw_train_df.to_feather(os.path.join(conf.DATA_DIR,'raw_train_df.feather'))

In [56]:
# merge test dfs
raw_test_df = test_click_log_df.merge(test_ad_df,how='left',on='creative_id')

In [57]:
correct_column_type_by_value_range(raw_test_df)

2020-06-26 18:22:11,668 - utils.utils - INFO - correct_column_type_by_value_range开始
2020-06-26 18:22:11,669 - utils.utils - INFO - check_columns开始
2020-06-26 18:22:11,670 - utils.utils - INFO - check_columns已完成，共用时0:00:00
2020-06-26 18:22:21,868 - utils.utils - INFO - col_types: time                    int8
user_id                int64
creative_id            int64
click_times            int16
ad_id                  int32
product_id           float64
product_category    category
advertiser_id          int32
industry            category
dtype: object
2020-06-26 18:22:21,870 - utils.utils - INFO - correct_column_type_by_value_range已完成，共用时0:00:10

In [58]:
raw_test_df.head()

,time,user_id,creative_id,click_times,ad_id,product_id,product_category,advertiser_id,industry
12849660,1,3892830,112276,1,101587,NaN,18,8371,54.0
23535382,1,3530749,14391,1,15775,1261.0,2,10988,6.0
9820227,1,3711528,208390,1,187259,1261.0,2,10925,6.0
9820228,1,3711528,236102,1,212289,1261.0,2,19056,98.0
31351701,1,3998628,90699,1,82895,NaN,18,10955,238.0

In [59]:
raw_test_df.dtypes

time                    int8
user_id                int64
creative_id            int64
click_times            int16
ad_id                  int32
product_id           float64
product_category    category
advertiser_id          int32
industry            category
dtype: object

In [60]:
raw_test_df.reset_index(drop=True, inplace=True)

In [61]:
raw_test_df.to_feather(os.path.join(conf.DATA_DIR, 'raw_test_df.feather'))